logs/sysbench/old/20190505/thread_w4_20190505194757.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 836.04 qps: 5017.77 (r/w/o: 0.00/3345.28/1672.49) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 845.68 qps: 5074.05 (r/w/o: 0.00/3382.80/1691.25) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 680.32 qps: 4081.65 (r/w/o: 0.00/2721.00/1360.65) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 214.70 qps: 1287.81 (r/w/o: 0.00/858.40/429.40) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 602.28 qps: 3614.18 (r/w/o: 0.00/2409.52/1204.66) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 975.82 qps: 5854.79 (r/w/o: 0.00/3903.16/1951.63) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           166224
        other:                           83112
        total:                           249336
    transactions:                        41556  (692.48 per sec.)
    queries:                             249336 (4154.90 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0059s
    total number of events:              41556

Latency (ms):
         min:                                  0.99
         avg:                                  5.77
         max:                                223.51
         95th percentile:                     13.22
         sum:                             239898.00

Threads fairness:
    events (avg/stddev):           10389.0000/43.27
    execution time (avg/stddev):   59.9745/0.00